Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СписаниеТоваров</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РеализацииОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратТоваровПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВозвратТоваровПоставщику</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РеализацииОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеТоваров/Forms/ФормаДокументаУ/Ext/Form/Module.bsl
&НаСервере
Процедура B1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяКомандаЗаполнитьПоРеализациям = Команды.Добавить("ЗаполнитьПоРеализациям");
	НоваяКомандаЗаполнитьПоРеализациям.Действие = "ЗаполнитьПоРеализациям";
	НоваяКомандаЗаполнитьПоРеализациям.Заголовок = НСтр("ru = 'Заполнить по реализациям'");
	
	КомандаЗаполнитьПоРеализациям = Элементы.Добавить("ЗаполнитьПоРеализациям", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
	КомандаЗаполнитьПоРеализациям.ИмяКоманды = "ЗаполнитьПоРеализациям";
	КомандаЗаполнитьПоРеализациям.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	СтраницаРеализацииОснования = Элементы.Добавить("СтраницаРеализацииОснования", Тип("ГруппаФормы"), Элементы.ОсновнаяПанель);
	СтраницаРеализацииОснования.Заголовок = НСтр("ru = 'Реализации-основания'");
	СтраницаРеализацииОснования.Вид = ВидГруппыФормы.Страница;
	
	ТаблицаРеализацииОснования = Элементы.Добавить("РеализацииОснования", Тип("ТаблицаФормы"), СтраницаРеализацииОснования);
	ТаблицаРеализацииОснования.ПутьКДанным = "Объект.РеализацииОснования";
	ТаблицаРеализацииОснования.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабЧасти = Об.Метаданные().ТабличныеЧасти;	
	
	Для каждого КолонкаОбъекта Из ТабЧасти.РеализацииОснования.СтандартныеРеквизиты Цикл
		
		ИмяКолонки = "РеализацииОснования" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТаблицаРеализацииОснования);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.РеализацииОснования." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
	Для каждого КолонкаОбъекта Из ТабЧасти.РеализацииОснования.Реквизиты Цикл
		
		ИмяКолонки = "РеализацииОснования" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТаблицаРеализацииОснования);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.РеализацииОснования." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеализациям()

	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнениеИзРеализацийТабличнныхЧастейЗавершение", ЭтотОбъект),
			"Очистить табличную часть перед заполнением?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ЗаполнениеИзРеализацийТабличнныхЧастейФрагмент();

КонецПроцедуры // ()

&НаКлиенте
Процедура ЗаполнениеИзРеализацийТабличнныхЧастейЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		Объект.РеализацииОснования.Очистить();
	КонецЕсли;

	ЗаполнениеИзРеализацийТабличнныхЧастейФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеИзРеализацийТабличнныхЧастейФрагмент()

	ОткрытьФорму("Документ.ВозвратТоваровПоставщику.Форма.ФормаПодбораРеализаций", , , , , ,
		Новый ОписаниеОповещения("ЗаполнениеИзРеализацийТабличнныхЧастейФрагментЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеИзРеализацийТабличнныхЧастейФрагментЗавершение(Результат, ДополнительныеПараметры) Экспорт

	МассивДокументов = Результат;

	Если МассивДокументов = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Для каждого Документ Из МассивДокументов Цикл
		
		НовСтр = Объект.РеализацииОснования.Добавить();
		НовСтр.Реализация = Документ;
		
		ювЗагрузитьВТабличнуюЧасть(Документ);

	КонецЦикла;
	
	//ОбновлениеОтображенияКлиент();
	
КонецПроцедуры

&НаСервере
Процедура B1_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Отказ и ПараметрыЗаписи.РежимЗаписи	= РежимЗаписиДокумента.Проведение Тогда
	
		Для каждого СтрокаРеализации Из ТекущийОбъект.РеализацииОснования Цикл
		
			Если СтрокаРеализации.Реализация.Проведен ИЛИ НЕ СтрокаРеализации.Реализация.ПометкаУдаления Тогда
			
				ОбРеализация = СтрокаРеализации.Реализация.ПолучитьОбъект();
				
				Если ОбРеализация.Проведен Тогда
				
					Попытка
						
						ОбРеализация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
					Исключение
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось распровести " + ОбРеализация, ОбРеализация.Ссылка);
						
					КонецПопытки;	
				
				КонецЕсли;
				
				Если НЕ ОбРеализация.ПометкаУдаления Тогда
				
					Попытка
				
						ОбРеализация.ПометкаУдаления = Истина;
						ОбРеализация.Записать(РежимЗаписиДокумента.Запись);
				
					Исключение
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить пометку удаления " + ОбРеализация, ОбРеализация.Ссылка);
						
					КонецПопытки;	
				
				КонецЕсли; 				 
			
			КонецЕсли; 	
		
		КонецЦикла; 	
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
//Процедура загружает данные из табличной части источника в приемник
//
//Параметры:
//ТаблицаИсточник - табличная часть источник
//ТаблицаПриемник - табличная часть приемник
//ДокументИсточник - строка
//
Процедура ювЗагрузитьВТабличнуюЧасть(Документ)

	Попытка
		//(арт
		МетаданныеТаблицаИсточник = Метаданные.НайтиПоТипу(ТипЗнч(Документ.Товары));
		МетаданныеТаблицаПриемник = Объект.Ссылка.Метаданные().ТабличныеЧасти.Товары;

	Исключение
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Из этого документа невозможно скопировать табличную часть!");
	КонецПопытки;
	
	//Сформируем массив совпадающих колонок.
	МассивСовпадающихКолонок = Новый Массив;
	Для Каждого РеквизитКолонка Из МетаданныеТаблицаПриемник.Реквизиты Цикл

		Если МетаданныеТаблицаИсточник.Реквизиты.Найти(РеквизитКолонка.Имя) <> Неопределено Тогда

			МассивСовпадающихКолонок.Добавить(РеквизитКолонка.Имя);

		КонецЕсли;

	КонецЦикла;

	ФлагПоступленияПеремещения 		= Ложь;
	ФлагПоступленияНТТПеремещения	= Ложь;

	Если Документ <> Неопределено Тогда

		ФлагОприходованиеПеремещения	= МетаданныеТаблицаИсточник.Родитель().Имя = "ОприходованиеТоваров"
			И МетаданныеТаблицаПриемник.Родитель().Имя = "ПеремещениеТоваров";

		ФлагПоступленияПеремещения		= МетаданныеТаблицаИсточник.Родитель().Имя = "ПоступлениеТоваровУслуг"
			И МетаданныеТаблицаПриемник.Родитель().Имя = "ПеремещениеТоваров";

		ФлагПоступленияНТТПеремещения 	= МетаданныеТаблицаИсточник.Родитель().Имя = "ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку"
			И МетаданныеТаблицаПриемник.Родитель().Имя = "ПеремещениеТоваров";
	КонецЕсли;
	Для Каждого СтрокаТаблицыИсточника Из Документ.Товары Цикл

		СтрокаТаблицыПриемника = Объект.Товары.Добавить();
		
		// Заполним значения в совпадающих колонках.
		Для Каждого ЭлементМассива Из МассивСовпадающихКолонок Цикл

			СтрокаТаблицыПриемника[ЭлементМассива] = СтрокаТаблицыИсточника[ЭлементМассива];

		КонецЦикла;
		
		// Обработаем несовпадающие по наименованиям колонки
		Если ФлагПоступленияПеремещения Тогда
			
			// обнулим цену и сумму, которые заполнились по ценам поступления
			СтрокаТаблицыПриемника.Цена 			= 0;
			СтрокаТаблицыПриемника.Сумма 			= 0;
			СтрокаТаблицыПриемника.СуммаПоступления = СтрокаТаблицыИсточника.Сумма + ?(Документ.СуммаВключаетНДС, 0,
				СтрокаТаблицыИсточника.СуммаНДС);
			СтрокаТаблицыПриемника.ЦенаПоступления  = ?(СтрокаТаблицыПриемника.СерияНоменклатуры.Весовой,
				СтрокаТаблицыПриемника.СуммаПоступления / СтрокаТаблицыПриемника.Вес,
				СтрокаТаблицыПриемника.СуммаПоступления / СтрокаТаблицыПриемника.Количество);

		ИначеЕсли ФлагПоступленияНТТПеремещения Тогда

			СтрокаТаблицыПриемника.СуммаПоступления = СтрокаТаблицыИсточника.Сумма + ?(Документ.СуммаВключаетНДС, 0,
				СтрокаТаблицыИсточника.СуммаНДС);
			СтрокаТаблицыПриемника.ЦенаПоступления  = ?(СтрокаТаблицыПриемника.СерияНоменклатуры.Весовой,
				СтрокаТаблицыПриемника.СуммаПоступления / СтрокаТаблицыПриемника.Вес,
				СтрокаТаблицыПриемника.СуммаПоступления / СтрокаТаблицыПриемника.Количество);

			СтрокаТаблицыПриемника.Цена  = СтрокаТаблицыИсточника.ЦенаВРознице;
			СтрокаТаблицыПриемника.Сумма = СтрокаТаблицыИсточника.ЦенаВРознице * СтрокаТаблицыПриемника.Количество;

		ИначеЕсли ФлагОприходованиеПеремещения Тогда
			
			
			
			// обнулим цену и сумму, которые заполнились по ценам поступления
			СтрокаТаблицыПриемника.Цена 					= СтрокаТаблицыИсточника.ЦенаВРознице;
			СтрокаТаблицыПриемника.ЦенаВРозницеГр 			= 0;
			СтрокаТаблицыПриемника.ПроцентРозничнойНаценки	= СтрокаТаблицыИсточника.ПроцентРозничнойНаценки;
			СтрокаТаблицыПриемника.СуммаПоступления 		= СтрокаТаблицыИсточника.Сумма;
			СтрокаТаблицыПриемника.ЦенаПоступления  		= ?(СтрокаТаблицыПриемника.СерияНоменклатуры.Весовой,
				СтрокаТаблицыПриемника.СуммаПоступления / СтрокаТаблицыПриемника.Вес,
				СтрокаТаблицыПриемника.СуммаПоступления / СтрокаТаблицыПриемника.Количество);
			// Рассчитать реквизиты табличной части.
			Если СтрокаТаблицыИсточника.СерияНоменклатуры.Весовой Тогда
				СтрокаТаблицыПриемника.ЦенаВРозницеГр = ?(СтрокаТаблицыПриемника.Вес = 0, 0,
					СтрокаТаблицыПриемника.Цена / СтрокаТаблицыПриемника.Вес);
			Иначе
				СтрокаТаблицыПриемника.ЦенаВРозницеГр = 0;
			КонецЕсли;

			СтрокаТаблицыПриемника.Сумма 	= СтрокаТаблицыПриемника.Цена * СтрокаТаблицыПриемника.Количество;
		КонецЕсли;

	КонецЦикла;
	//арт)
КонецПроцедуры
